Tekla.Structures.ModelInternal.dotLegFace_t
The structure for passing legface data between OpenAPI and core.

Tekla.Structures.ModelInternal.dotLegFace_t.Id
The database id.

Tekla.Structures.ModelInternal.dotLegFace_t.OffsetType
The offset type.

Tekla.Structures.ModelInternal.dotLegFace_t.Offset
The offset.

Tekla.Structures.ModelInternal.dotLegFace_t.LayerOrderNumber
The layer order number.

Tekla.Structures.ModelInternal.dotLegFace_t.Reversed
Reversed flag.

Tekla.Structures.ModelInternal.dotLegFace_t.Frozen
The frozen value.

Tekla.Structures.ModelInternal.dotLegFace_t.FirstPoint
The index of the first point in the rebarset's overall points list.

Tekla.Structures.ModelInternal.dotLegFace_t.NumberOfPoints
The number of contour points.